app/controllers/admin/recipes_controller.rb

	def create
			@recipe = Recipe.new(title: params[:title], description: params[:description], ingredients: params[:ingredients])
	        	if @recipe.save
---
INSERT INTO "recipes" ("title", "description", "ingredients", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

	def update

		@recipe = Recipe.find(params[:id])

		if @recipe.update(title: params[:title], description: params[:description], ingredients: params[:ingredients])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
UPDATE "recipes" SET "title" = $1, "description" = $2, "ingredients" = $3, "updated_at" = $4 WHERE "recipes"."id" = $5  [["title", "Gnocchis"], ["description", "Un update"], ["ingredients", ""], ["updated_at", "2020-04-04 12:52:34.587182"], ["id", 28]]

	def destroy
			@recipe = Recipe.find(params[:id])
			if @recipe.delete
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 1]]